<center>北京师范大学</center>
<center>2022-2023学年春季学期  “网络实验”实验报告</center>
<center><b><font size=6 bold=true>实验06：VLAN配置</font><b></center>




| 姓    名 |   学    号   | 学    院 | 日    期  |
| :------: | :----------: | :------: | :-------: |
|  段欣然  | 202011081033 | 人工智能 | 2023.4.12 |

<hr>

**1.实验目的**：

- VLAN（Virtual Local Area Network）是一种通过逻辑方式而不是物理方式划分局域网的技术，可以提高网络性能、安全性和管理效率。
- VLAN的划分方法有基于端口、基于MAC地址、基于协议和基于IP组播等。
- VLAN之间的通信需要路由器或三层交换机的支持。
- 本实验旨在掌握VLAN的原理和配置方法，以及如何使用三层交换机实现不同VLAN间的路由。

**2.实验内容**：

- 实验拓扑图如下：

![image-20230412175955991](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412175955991.png)

- 实验设备包括一台三层交换机、两台二层交换机和两台PC机。

$\boxtimes$ 基础性实验  $\square$  综合性实验  $\square$ 设计性实验

<hr>													
<center><b><font size=6>实验报告正文</font></b></center>


# 实验过程

## 建立网络拓扑

拓扑图如上，包括一个路由器，两个交换机和两个PC机

| 名称         | IP地址        |
| ------------ | ------------- |
| PC0          | 192.168.2.100 |
| PC1          | 192.168.2.10  |
| VLAN 100     | 192.168.1.1   |
| VLAN 200     | 192.168.2.1   |
| Router0 g0/0 | 192.168.1.2   |
| lo0          | 1.1.1.1       |

## 配置VLAN

```sh
SW1(config) #vlan 100
SW1(config-vlan) #vlan 200

SW1(config) #int vlan 100
SW1(config-if) #ip add 192.168.1.1 255.255.255.0
SW1(config-if) #int vlan 200
SW1(config-if) #ip add 192.168.2.1 255.255.255.0
```



```sh
SW2(config) #vlan 100
SW2(config-vlan) #vlan 200
```

## 配置trunk

对`SW1 0/2`和`SW2 0/1`进行如下配置

```sh
switchport trunk encap dot1q
switchport mode trunk
```

## 端口划分

将`SW1 0/1`划分到`vlan 100`，`SW1 0/4, SW2 0/3`划分到`vlan 200`

```sh
SW1(config)#int f0/1
SW1(config-if)#switchport access vlan 100

SW1(config)#int f0/4
SW1(config-if)#switchport access vlan 200
```

```sh
SW2(config)#int f0/3
SW2(config-if)#switchport access vlan 200
```

## 生成树设置

设置`SW1`为主根，`SW2`为次根

```sh
SW1(config)#spanning-tree vlan 1-500 root primary
```

```sh
SW2(config)#spanning-tree vlan 1-500 root secondary
```

## 路由器和OSPF设置

### 路由器设置

![image-20230412221951984](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412221951984.png)

```sh
Router(config)#int lo0
Router(config-if)#ip add 1.1.1.1 255.255.255.0
```

### OSPF配置

```sh
Router(config)#router os 1
Router(config-router)#net 192.168.1.0 0.0.0.255 area 0
Router(config-router)#net 1.1.1.0 0.0.0.255 area 0
```

```sh
SW1(config)#ip routing
SW1(config)#router os 1
SW1(config-router)#net 192.168.1.0 0.0.0.255 area  0
SW1(config-router)#net 192.168.2.0 0.0.0.255 area  0
```



# 实验结果

PC0 

​	`ping 1.1.1.1`成功

![image-20230412222159960](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412222159960.png)

​	`ping 192.168.2.10`成功

![image-20230412222312254](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412222312254.png)

PC1

​	`ping 192.168.2.100`成功

![image-20230412222419480](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412222419480.png)

​	`ping 1.1.1.1`成功

![image-20230412222445354](D:\大三冲刺\网络实验\实验报告\lab6\image-20230412222445354.png)

# 实验反思

本实验通过配置VLAN和trunk，实现了二层网络的划分和连接，提高了网络的安全性和效率。通过本实验，我学习了以下知识和技能：

- VLAN是一种在物理网络上逻辑划分子网的技术，可以根据业务需求或安全策略将不同端口或设备划分到不同的广播域中，减少广播风暴，提高网络性能，增强网络安全。
- trunk是一种在多个交换机之间传输多个VLAN信息的技术，可以使用单个物理链路承载多个逻辑链路，节省端口资源，扩展网络规模，简化网络管理。
- VLAN和trunk的配置方法和命令，包括如何创建、删除、查看、修改VLAN，如何指定接口的link-type、default-vlan、allow-pass vlan等参数，如何验证配置是否正确等。
- VLAN和trunk的工作原理和流程，包括如何在接口上添加或删除标签（tag），如何在trunk上封装或解封装标签（encapsulation/decapsulation），如何根据标签进行转发或过滤等。

本实验还存在以下不足和改进空间：

- 实验环境较简单，只涉及两台交换机和四台PC机，没有考虑更复杂的网络拓扑和业务场景。
- 实验过程较单一，只涉及基本的VLAN和trunk配置和测试，并没有涉及更高级的功能和技巧，例如VTP、DTP、ISL、802.1Q等。
- 实验报告较简略，只描述了实验目的、步骤、结果和总结，并没有详细记录每一步的操作命令、输出信息、截图等证据。
